src/readme.org
* Sobre este archivo y repositorio
Este archivo documenta algunos videos del [[https://www.youtube.com/watch?v%3DcoK4jM5wvko&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][curso de Java desde 0]] dado
en el canal [[https://www.youtube.com/user/pildorasinformaticas/featured][pildorasinformaticas]] de Juan Gómez.

El fin de esto es dar una especie de índice para que sea cómodo
conocer que es lo que se trata en cada video.

Se incluye el título del video, un enlace al mismo, una breve
descripción del tema que se trate y el producto que se obtiene al
llegar al final del video (normalmente la interfaz gráfica). Todo esto
sacado de la explicación, conocimiento, he incluso palabras de Juan
Gómez.

El código de cada video, está disponible en paquetes en este
repositorio. El nombre de cada paquete se toma del número del video
correspondiente.

* Clases Internas
- video51 :: interfaces III
- video52 :: interfaces IV
- video53 :: clases internas I
- video54 :: clases internas II

* Aplicaciones gráficas
- video55 :: Swing I
- video56 :: Swing II. Colocando el Frame I
- video57 :: Swing III. Colocando el Frame II
- video58 :: Swing IV. Escribiendo en el Frame
- video59 :: Swing V. Dibujando en el Frame

* Eventos

** Overview
*** [[[https://www.youtube.com/watch?v%3Db8rkMBnXuwk&index%3D65&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video65]]] Eventos I. Teoría sobre eventos
Entre los tipos de eventos podemos mencionar: (min 6:01)
- Evento de raton, al hacer click
- Eventos de teclado, al pulsar alguna tecla
- Eventos de ventana, al redimensionar, abrir, cerrar una ventana

Eventos: fuentes y oyentes (min 8:04)

#+BEGIN_EXAMPLE
                          +-----------------------------+         +-------------+
  		        / | ¿Qué desencadena la acción? |-------->|Objeto evento|
                       /  +-----------------------------+         +-------------+
 	              /	       ej:click
 	             /
 	            /
    +-------------+/      +-------------------------------+       +-------------+
    |tres factores|------ | ¿Quién desencadena la acción? |------>|Objeto Fuente|
    +-------------+\	  +-------------------------------+       +-------------+
 		    \	     ej: click boton, click menu, etc.
 		     \
 		      \
 		       \   +-------------------------+            +---------------+
 		        \  |¿Quien recibe la accion? |----------->|Objeto Listener|
 		           +-------------------------+	          +---------------+
 		                     ej: JPanel
#+END_EXAMPLE

Para manejar /Objetos Evento/ lo modela la clase =EventObject=. Las
mas utilizadas son sus clases hijas: =ActionEvent= y =WindowEvent=.

NOTA: este paquete (porque asi fue el video) solo sirve de introducción
a los eventos, puesto que no se realiza nada gráfico en concreto, solo
se dejan las clases para reanudar la construcción en el siguiente video.


*** [[[https://www.youtube.com/watch?v%3DzwSub29uORc&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D66][video66]]] Eventos II.
Se crea un JFrame con tres botones que al hacer click se pinta de
azul, amarillo o rojo el JPanel que esta contenido en el JFrame.

*** [[[https://www.youtube.com/watch?v%3DR8fnLtVuLxA&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D67][video67]]] Eventos III
Se reliza lo mismo que el /video66/ pero haciendo uso del concepto de
clases internas.

** Eventos de ventana

*** [[[https://www.youtube.com/watch?v%3DR8fnLtVuLxA&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D67][video68]]] Eventos IV. Eventos de ventana I.
Es un poco mas laborioso ya que para eventos de ventana hay que
implementar la interfaz =WindowListener=. Esta interfaz requiere que se
implemente siete métodos. Puede implementarse solo uno, o dos métodos,
pero eso se verá en el siguiente video.

En este video se crean dos ventanas tituladas "Ventana 1" y "Ventana
2". Se les pone ha escuchar los Eventos de ventana.

