src/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>readme</title>
<!-- 2018-03-05 lun 21:00 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="wegt" />
</head>
<body>
<div id="content">
<h1 class="title">readme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Sobre este archivo y repositorio</a></li>
<li><a href="#sec-2">2. Clases Internas</a></li>
<li><a href="#sec-3">3. Aplicaciones gráficas</a></li>
<li><a href="#sec-4">4. Eventos</a>
<ul>
<li><a href="#sec-4-1">4.1. Overview</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. [video65] Eventos I. Teoría sobre eventos</a></li>
<li><a href="#sec-4-1-2">4.1.2. [video66] Eventos II.</a></li>
<li><a href="#sec-4-1-3">4.1.3. [video67] Eventos III</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. Eventos de ventana</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. [video68] Eventos IV. Eventos de ventana I.</a></li>
<li><a href="#sec-4-2-2">4.2.2. [video69] Eventos V. Eventos de ventana II</a></li>
<li><a href="#sec-4-2-3">4.2.3. [video70] Eventos VI Eventos de ventana III.</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. Eventos de teclado</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1. [video71] Eventos VII. Eventos de teclado I</a></li>
</ul>
</li>
<li><a href="#sec-4-4">4.4. Eventos de ratón</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1. [video72] Eventos VIII. Eventos de ratón I</a></li>
<li><a href="#sec-4-4-2">4.4.2. [video73] Eventos IX. Eventos de ratón II</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5. Eventos de foco</a>
<ul>
<li><a href="#sec-4-5-1">4.5.1. [video74] Eventos X. Eventos de foco I</a></li>
<li><a href="#sec-4-5-2">4.5.2. [video75] Eventos XI. Eventos de foco II</a></li>
</ul>
</li>
<li><a href="#sec-4-6">4.6. Multiples fuentes de eventos</a>
<ul>
<li><a href="#sec-4-6-1">4.6.1. [video76] Eventos XII. Múltiples fuentes I</a></li>
<li><a href="#sec-4-6-2">4.6.2. [video77] Eventos XIII. Múltiples fuentes II</a></li>
<li><a href="#sec-4-6-3">4.6.3. [video78] Eventos XIV. Múltiples fuentes III</a></li>
<li><a href="#sec-4-6-4">4.6.4. [video79] Eventos XV. Múltiples fuentes IV</a></li>
<li><a href="#sec-4-6-5">4.6.5. [video80] Eventos XVI. Múltiples oyentes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. Layouts</a>
<ul>
<li><a href="#sec-5-1">5.1. [video81] Layouts I. Componentes Swing</a></li>
<li><a href="#sec-5-2">5.2. [video82] Layouts II</a></li>
<li><a href="#sec-5-3">5.3. [video83] Layouts III</a></li>
<li><a href="#sec-5-4">5.4. [video84] Layouts IV</a></li>
<li><a href="#sec-5-5">5.5. [video85] Layouts V</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Componentes Swing</a>
<ul>
<li><a href="#sec-6-1">6.1. Cuadros de texto</a>
<ul>
<li><a href="#sec-6-1-1">6.1.1. [video86] Cuadros de texto I</a></li>
<li><a href="#sec-6-1-2">6.1.2. [video87] Cuadros de texto II</a></li>
<li><a href="#sec-6-1-3">6.1.3. [video88] Eventos en cuadros de texto I</a></li>
<li><a href="#sec-6-1-4">6.1.4. [video89] Eventos en cuadros de texto II</a></li>
</ul>
</li>
<li><a href="#sec-6-2">6.2. Áreas de texto</a>
<ul>
<li><a href="#sec-6-2-1">6.2.1. [video90] Áreas de texto I</a></li>
<li><a href="#sec-6-2-2">6.2.2. [video91] Áreas de texto II</a></li>
</ul>
</li>
<li><a href="#sec-6-3">6.3. CheckBox</a>
<ul>
<li><a href="#sec-6-3-1">6.3.1. [video92] CheckBox</a></li>
</ul>
</li>
<li><a href="#sec-6-4">6.4. Botones de radio</a>
<ul>
<li><a href="#sec-6-4-1">6.4.1. [video93] Botones de radio I</a></li>
<li><a href="#sec-6-4-2">6.4.2. [video94] Botones de radio II</a></li>
</ul>
</li>
<li><a href="#sec-6-5">6.5. ComboBox</a>
<ul>
<li><a href="#sec-6-5-1">6.5.1. [video95] ComboBox</a></li>
</ul>
</li>
<li><a href="#sec-6-6">6.6. JSlider</a>
<ul>
<li><a href="#sec-6-6-1">6.6.1. [video96] JSlider I</a></li>
<li><a href="#sec-6-6-2">6.6.2. [video97] JSlider II</a></li>
</ul>
</li>
<li><a href="#sec-6-7">6.7. JSpinner</a>
<ul>
<li><a href="#sec-6-7-1">6.7.1. [video98] JSpinner I</a></li>
<li><a href="#sec-6-7-2">6.7.2. [video99] JSpinner II</a></li>
</ul>
</li>
<li><a href="#sec-6-8">6.8. [video100] Creación de menús I</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Sobre este archivo y repositorio</h2>
<div class="outline-text-2" id="text-1">
<p>
Este archivo documenta algunos videos del <a href="https://www.youtube.com/watch?v=coK4jM5wvko&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">curso de Java desde 0</a> dado
en el canal <a href="https://www.youtube.com/user/pildorasinformaticas/featured">pildorasinformaticas</a> de Juan Gómez.
</p>

<p>
El fin de esto es dar una especie de índice para que sea cómodo
conocer que es lo que se trata en cada video.
</p>

<p>
Se incluye el título del video, un enlace al mismo, una breve
descripción del tema que se trate y el producto que se obtiene al
llegar al final del video (normalmente la interfaz gráfica). Todo esto
sacado de la explicación, conocimiento, he incluso palabras de Juan
Gómez.
</p>

<p>
El código de cada video, está disponible en paquetes en este
repositorio. El nombre de cada paquete se toma del número del video
correspondiente.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Clases Internas</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> video51 </dt><dd>interfaces III
</dd>
<dt> video52 </dt><dd>interfaces IV
</dd>
<dt> video53 </dt><dd>clases internas I
</dd>
<dt> video54 </dt><dd>clases internas II
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Aplicaciones gráficas</h2>
<div class="outline-text-2" id="text-3">
<dl class="org-dl">
<dt> video55 </dt><dd>Swing I
</dd>
<dt> video56 </dt><dd>Swing II. Colocando el Frame I
</dd>
<dt> video57 </dt><dd>Swing III. Colocando el Frame II
</dd>
<dt> video58 </dt><dd>Swing IV. Escribiendo en el Frame
</dd>
<dt> video59 </dt><dd>Swing V. Dibujando en el Frame
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Eventos</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Overview</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> [<a href="https://www.youtube.com/watch?v=b8rkMBnXuwk&index=65&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video65</a>] Eventos I. Teoría sobre eventos</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
Entre los tipos de eventos podemos mencionar: (min 6:01)
</p>
<ul class="org-ul">
<li>Evento de raton, al hacer click
</li>
<li>Eventos de teclado, al pulsar alguna tecla
</li>
<li>Eventos de ventana, al redimensionar, abrir, cerrar una ventana
</li>
</ul>

<p>
Eventos: fuentes y oyentes (min 8:04)
</p>

<pre class="example">
                      +-----------------------------+         +-------------+
  		    / | ¿Qué desencadena la acción? |--------&gt;|Objeto evento|
                   /  +-----------------------------+         +-------------+
 	          /	       ej:click
 	         /
 	        /
+-------------+/      +-------------------------------+       +-------------+
|tres factores|------ | ¿Quién desencadena la acción? |------&gt;|Objeto Fuente|
+-------------+\	  +-------------------------------+       +-------------+
 		\	     ej: click boton, click menu, etc.
 		 \
 		  \
 		   \   +-------------------------+            +---------------+
 		    \  |¿Quien recibe la accion? |-----------&gt;|Objeto Listener|
 		       +-------------------------+	          +---------------+
 		                 ej: JPanel
</pre>

<p>
Para manejar <i>Objetos Evento</i> lo modela la clase <code>EventObject</code>. Las
mas utilizadas son sus clases hijas: <code>ActionEvent</code> y <code>WindowEvent</code>.
</p>

<p>
NOTA: este paquete (porque asi fue el video) solo sirve de introducción
a los eventos, puesto que no se realiza nada gráfico en concreto, solo
se dejan las clases para reanudar la construcción en el siguiente video.
</p>
</div>
</div>


<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> [<a href="https://www.youtube.com/watch?v=zwSub29uORc&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=66">video66</a>] Eventos II.</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
Se crea un JFrame con tres botones que al hacer click se pinta de
azul, amarillo o rojo el JPanel que esta contenido en el JFrame.
</p>
</div>
</div>

<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3"><span class="section-number-4">4.1.3</span> [<a href="https://www.youtube.com/watch?v=R8fnLtVuLxA&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=67">video67</a>] Eventos III</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
Se reliza lo mismo que el <i>video66</i> pero haciendo uso del concepto de
clases internas.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Eventos de ventana</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> [<a href="https://www.youtube.com/watch?v=R8fnLtVuLxA&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=67">video68</a>] Eventos IV. Eventos de ventana I.</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Es un poco mas laborioso ya que para eventos de ventana hay que
implementar la interfaz <code>WindowListener</code>. Esta interfaz requiere que se
implemente siete métodos. Puede implementarse solo uno, o dos métodos,
pero eso se verá en el siguiente video.
</p>

<p>
En este video se crean dos ventanas tituladas "Ventana 1" y "Ventana
2". Se les pone ha escuchar los Eventos de ventana.
</p>
</div>
</div>
