src/readme.org
*** [[[https://www.youtube.com/watch?v%3DQZrNfAJG3fA&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D69][video69]]] Eventos V. Eventos de ventana II
Es bastante labo.ioso ..abajar e entos de ventana por la interfaz
=WindowListener= ..plementa un m      de métodos y eso nos obliga a
proo.amar todos ellos. Existe una  olución en Java más elegante, a la
horo de pr.gramar eventos de ventana, que consiste en eluso de /clases
adaptadoras/ (Adapter classes).

Las /clases adaptadoras/ es una solución para que el código de
programación sea mas corto, limpio y claro.

#+BEGIN_EXAMPLE

   +--------------+	  +-------------------+		 +------------------+
   |KeyAdapter (C)|  	  | WindowAdapter (C) | 	 | MouseAdapter (C) |
   +--------------+	  +-------------+-----+		 +------------------+
					|
	 +------------------------+	|    +-------------------------+
	 | WindowFocusListener (I)|<----+--->| WindowStateListener (I) |
	 +------------------------+	|    +-------------------------+
				        |
	 +------------------------+     |    +--------------------+
	 | WindowListener (I)     |<----+--->|EventListener (I)   |
	 +------------------------+          +--------------------+
#+END_EXAMPLE

=WindowAdapter= es una clase adaptadora que deberíamos utilizar cuando
creemos programas que responden a eventos de ventana. Esta clase
implementa cuatro interfaces (las etiquetadas con (I) en el diagrama
de arriba).

En este paquete se modifica la del /video68/  utilizando la
clase =WindowAdapter=.

Hay programadores que consideran mejor extender la interfaz
=WindowListener= he implementar todos sus métodos y no heredar de la
clase =WindowAdapter=.

*** [[[https://www.youtube.com/watch?v%3DH_1kldp-d7I&index%3D70&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video70]]] Eventos VI Eventos de ventana III.
Como controlar los estados de la ventana. Por ejemplo como
desencadenar una acción cuando una ventana cambia de estado (cuando es
minimizada, maximizada, restaurada, etc).

#+BEGIN_EXAMPLE
	   +---------------+			  +------------------------+
  	   |WindowEvent (C)|   	                  | WindowStateListener (I)|
	   +-----------+---+			  +------------+-----------+
     		       |				       v
                       |                          +--------------------------------------+
   +-----------------+ |  +-----------------+     | WindowStateChanged(WindowEvent e) (M)|
   |getNewState() (M)|<+->|getOldState() (M)|     +--------------------------------------+
   +-----------------+	  +-----------------+
#+END_EXAMPLE

El método =getNewState()= nos devuelve el esta nuevo de la ventana. Y
el método =getOldstate()= nos devuelve el estado anterior de la
ventana.

Se elabora un primer ejemplo que tendrá un marco que cuando cambie su
estado, que desencadene una acción (mensaje en consola).

Después de este primer ejemplo, se añade otras caracteristicas para
saber en concreto cual es el estado que ha adquirido la ventana.

** Eventos de teclado

*** [[[Eventos%20VII.%20Eventos%20de%20teclado%20I][video71]]] Eventos VII. Eventos de teclado I
Eventos de teclado significa como conseguir que nuestros programas
desencadenen acciones, hagan algo, en función de las teclas que pueda
pulsar el usuario. Es decir, seremos capaces de hacer de que nuestro
programa haga una acción en concreto si el usuario pulsa una tecla en
concreto  y que nuestro programa haga otra cosa diferente si el
usuario ha pulsado otra tecla diferente. Esto es lo que conseguimos
con los eventos del teclado.

#+BEGIN_EXAMPLE
	+------------------+
	|  KeyListener (I) |
	+--------+---------+
		 |
     +-----------v----------------+
     | KeyPressed(KeyEvent e) (M) |		     +----------------+
     +------------+---------------+		     |         	      |
		  |				     |  KeyAdapter (C)|
     +------------+----------------+		     |                |
     | KeyReleased(KeyEvent e) (M) |		     +----------------+
     +------------+----------------+
       		  |
     +------------+--------------+
     | KeyTyped(KeyEvent e) (M)  |
     +---------------------------+
#+END_EXAMPLE

El método =KeyPressed(KeyEvent e)= es llamado cuando una tecla es
presionada.

El método =KeyReleased(KeyEvent e)= es llamado justo el momento cuando
quitamos el dedo del teclado.

El método =KeyTyped(KeyEvent e)= es la suma de las dos
anteriores. Tiene lugar cuando, han tenido ya, los dos sucesos, es
decir, ya ha sido presionada y posteriormente la tecla ha vuelto ha su
estado original (vuelto a subir).

Luego como hemos visto anteriormente todas aquellas interfaces que
tienen más de un método en su interior, =KeyListener= es una de ellas,
tiene su correspondiente /clase adaptadora/ .

** Eventos de ratón

*** [[[https://www.youtube.com/watch?v%3DSMLwQxlPa9w&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D72][video72]]] Eventos VIII. Eventos de ratón I
Son muy importantes a la hora de manejar interfaces gráficas ya que
cuando construimos una interfaz, que por ejemplo botones, menus,
objetos que se tienene que arrastrar,  pues tenemos que manejar
eventos de ratón.

Los eventos de ratón nos van ha permitir detectar  cuando el usuario,
por ejemplo, ha pulsado el botón izquierdo, ha pulsado el botón
derecho, ha utilizado la rueda del ratón, detectar si solo ha hecho un
click o doble click encima de un componente. Si ha pasado el ratón por
encima de un elemento o no, etc. 

#+BEGIN_EXAMPLE
		       +--------------------+	    +------------------+
		       | MouseListener (I)  |-------| MouseAdapter (C) |
		       +--------------+-----+	    +------------------+
				      |
+-------------------------------+     |       +------------------------------+
| mouseClicked(MouseEvent e) (M)|-----+-------| mouseExited(MouseEvent e) (M)|
+-------------------------------+     |       +------------------------------+
				      |
				      |
+-------------------------------+     |       +-------------------------------+
| mouseEntered(MouseEvent e) (M)|-----+-------| mousePressed(MouseEvent e) (M)|
+-------------------------------+     |       +-------------------------------+
				      |
				      |
                                      |       +--------------------------------+
 				      +-------| mouseReleased(MouseEvent e) (M)|
                                              +--------------------------------+
#+END_EXAMPLE

=mousePressed= desencadena la acción justo cuando pulsamos el botón
del ratón.

=mouseReleased= desencadena la acción justo después cuando el usuario
quita el dedo del ratón.

=mouseClicked= es invocado y desencadena la acción cuando ya han
tenido lugar los dos anteriores =mousePressed= y =mouseReleased=.

=mouseEntered= desencadena la acción cuando el ratón entra o pasa
encima de cierto componente que este a la escucha, por ejemplo un
botón o una imágen.

=mouseExited= al contrario de =mouseEntered=, se desencadena la acción
cuando estamos en un componente y arrastrando el ratón salimos de ese
elemento.

