src/readme.html

<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> [<a href="https://www.youtube.com/watch?v=QZrNfAJG3fA&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=69">video69</a>] Eventos V. Eventos de ventana II</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Es bastante labo.ioso ..abajar e entos de ventana por la interfaz
<code>WindowListener</code> ..plementa un m      de métodos y eso nos obliga a
proo.amar todos ellos. Existe una  olución en Java más elegante, a la
horo de pr.gramar eventos de ventana, que consiste en eluso de <i>clases
adaptadoras</i> (Adapter classes).
</p>

<p>
Las <i>clases adaptadoras</i> es una solución para que el código de
programación sea mas corto, limpio y claro.
</p>

<pre class="example">
+--------------+	  +-------------------+		 +------------------+
|KeyAdapter (C)|  	  | WindowAdapter (C) | 	 | MouseAdapter (C) |
+--------------+	  +-------------+-----+		 +------------------+
				     |
      +------------------------+	|    +-------------------------+
      | WindowFocusListener (I)|&lt;----+---&gt;| WindowStateListener (I) |
      +------------------------+	|    +-------------------------+
				     |
      +------------------------+     |    +--------------------+
      | WindowListener (I)     |&lt;----+---&gt;|EventListener (I)   |
      +------------------------+          +--------------------+
</pre>

<p>
<code>WindowAdapter</code> es una clase adaptadora que deberíamos utilizar cuando
creemos programas que responden a eventos de ventana. Esta clase
implementa cuatro interfaces (las etiquetadas con (I) en el diagrama
de arriba).
</p>

<p>
En este paquete se modifica la del <i>video68</i>  utilizando la
clase <code>WindowAdapter</code>.
</p>

<p>
Hay programadores que consideran mejor extender la interfaz
<code>WindowListener</code> he implementar todos sus métodos y no heredar de la
clase <code>WindowAdapter</code>.
</p>
</div>
</div>

<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> [<a href="https://www.youtube.com/watch?v=H_1kldp-d7I&index=70&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video70</a>] Eventos VI Eventos de ventana III.</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Como controlar los estados de la ventana. Por ejemplo como
desencadenar una acción cuando una ventana cambia de estado (cuando es
minimizada, maximizada, restaurada, etc).
</p>

<pre class="example">
	+---------------+			  +------------------------+
  	|WindowEvent (C)|   	                  | WindowStateListener (I)|
	+-----------+---+			  +------------+-----------+
     		    |				       v
                    |                          +--------------------------------------+
+-----------------+ |  +-----------------+     | WindowStateChanged(WindowEvent e) (M)|
|getNewState() (M)|&lt;+-&gt;|getOldState() (M)|     +--------------------------------------+
+-----------------+	  +-----------------+
</pre>

<p>
El método <code>getNewState()</code> nos devuelve el esta nuevo de la ventana. Y
el método <code>getOldstate()</code> nos devuelve el estado anterior de la
ventana.
</p>

<p>
Se elabora un primer ejemplo que tendrá un marco que cuando cambie su
estado, que desencadene una acción (mensaje en consola).
</p>

<p>
Después de este primer ejemplo, se añade otras caracteristicas para
saber en concreto cual es el estado que ha adquirido la ventana.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Eventos de teclado</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> [<i>video71</i>] Eventos VII. Eventos de teclado I</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Eventos de teclado significa como conseguir que nuestros programas
desencadenen acciones, hagan algo, en función de las teclas que pueda
pulsar el usuario. Es decir, seremos capaces de hacer de que nuestro
programa haga una acción en concreto si el usuario pulsa una tecla en
concreto  y que nuestro programa haga otra cosa diferente si el
usuario ha pulsado otra tecla diferente. Esto es lo que conseguimos
con los eventos del teclado.
</p>

<pre class="example">
   +------------------+
   |  KeyListener (I) |
   +--------+---------+
	    |
+-----------v----------------+
| KeyPressed(KeyEvent e) (M) |		     +----------------+
+------------+---------------+		     |         	      |
	     |				     |  KeyAdapter (C)|
+------------+----------------+		     |                |
| KeyReleased(KeyEvent e) (M) |		     +----------------+
+------------+----------------+
       	     |
+------------+--------------+
| KeyTyped(KeyEvent e) (M)  |
+---------------------------+
</pre>

<p>
El método <code>KeyPressed(KeyEvent e)</code> es llamado cuando una tecla es
presionada.
</p>

<p>
El método <code>KeyReleased(KeyEvent e)</code> es llamado justo el momento cuando
quitamos el dedo del teclado.
</p>

<p>
El método <code>KeyTyped(KeyEvent e)</code> es la suma de las dos
anteriores. Tiene lugar cuando, han tenido ya, los dos sucesos, es
decir, ya ha sido presionada y posteriormente la tecla ha vuelto ha su
estado original (vuelto a subir).
</p>

<p>
Luego como hemos visto anteriormente todas aquellas interfaces que
tienen más de un método en su interior, <code>KeyListener</code> es una de ellas,
tiene su correspondiente <i>clase adaptadora</i> .
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Eventos de ratón</h3>
<div class="outline-text-3" id="text-4-4">
</div><div id="outline-container-sec-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> [<a href="https://www.youtube.com/watch?v=SMLwQxlPa9w&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=72">video72</a>] Eventos VIII. Eventos de ratón I</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Son muy importantes a la hora de manejar interfaces gráficas ya que
cuando construimos una interfaz, que por ejemplo botones, menus,
objetos que se tienene que arrastrar,  pues tenemos que manejar
eventos de ratón.
</p>

<p>
Los eventos de ratón nos van ha permitir detectar  cuando el usuario,
por ejemplo, ha pulsado el botón izquierdo, ha pulsado el botón
derecho, ha utilizado la rueda del ratón, detectar si solo ha hecho un
click o doble click encima de un componente. Si ha pasado el ratón por
encima de un elemento o no, etc. 
</p>

<pre class="example">
		       +--------------------+	    +------------------+
		       | MouseListener (I)  |-------| MouseAdapter (C) |
		       +--------------+-----+	    +------------------+
				      |
+-------------------------------+     |       +------------------------------+
| mouseClicked(MouseEvent e) (M)|-----+-------| mouseExited(MouseEvent e) (M)|
+-------------------------------+     |       +------------------------------+
				      |
				      |
+-------------------------------+     |       +-------------------------------+
| mouseEntered(MouseEvent e) (M)|-----+-------| mousePressed(MouseEvent e) (M)|
+-------------------------------+     |       +-------------------------------+
				      |
				      |
                                      |       +--------------------------------+
 				      +-------| mouseReleased(MouseEvent e) (M)|
                                              +--------------------------------+
</pre>

<p>
<code>mousePressed</code> desencadena la acción justo cuando pulsamos el botón
del ratón.
</p>

<p>
<code>mouseReleased</code> desencadena la acción justo después cuando el usuario
quita el dedo del ratón.
</p>

<p>
<code>mouseClicked</code> es invocado y desencadena la acción cuando ya han
tenido lugar los dos anteriores <code>mousePressed</code> y <code>mouseReleased</code>.
</p>

<p>
<code>mouseEntered</code> desencadena la acción cuando el ratón entra o pasa
encima de cierto componente que este a la escucha, por ejemplo un
botón o una imágen.
</p>

<p>
<code>mouseExited</code> al contrario de <code>mouseEntered</code>, se desencadena la acción
cuando estamos en un componente y arrastrando el ratón salimos de ese
elemento.
</p>
</div>
</div>
