src/readme.org
*** [[[https://www.youtube.com/watch?v%3D9Zflg2FnVjo&index%3D73&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video73]]] Eventos IX. Eventos de ratón II
Veremos que métodos y que campos de clase utilizar, pertenecientes a
la clase =MouseEvent=, pues para detectar cosas como por ejemplo:
dónde ha hecho click el usuario dentro de un componente, para saber
donde esta situado el ratón en un momento en concreto, para saber si
ha pulsado el botón izquierdo o derecho, cuantos clicks ha hecho. Todo
esto lo controlamos con métodos pertenecientes a la clase
=MouseEvent=.

#+BEGIN_EXAMPLE
		      +--------------------+
		      |   MouseEvent (C)   |
		      +-------+------------+
		     	      |
+-------------------+	      |	     +----------------------+
| BUTTON1_DOWN_MASK |---------+------| getX() (M)           |
+-------------------+	      |      +----------------------+
		     	      |      +----------------------+
		     	      |------| getY() (M)           |
+-------------------+	      |      +----------------------+
| BUTTON2_DOWN_MASK |---------+      +----------------------+
+-------------------+ 	      |------| getModifiersEx() (M) |
		     	      |      +----------------------+
		     	      |      +----------------------+
+-------------------+	      |------+ getClickCount() (M)  |
| BUTTON3_DOWN_MASK |---------+      +----------------------+
+-------------------+
#+END_EXAMPLE

Hay otra interface muy interesante para controlar los eventos cuando
el ratón está en movimiento. Esta interface es
=MouseMotionListener=. En este paquete este se implementa con la clase
=EventoDeRatonMovimiento=.


** Eventos de foco

*** [[[https://www.youtube.com/watch?v%3DLMhk2Z7PcoE&index%3D74&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video74]]] Eventos X. Eventos de foco I
Por ejemplo cuando hay dos ventanas abiertas de una misma aplicación,
la ventana de foco o enfocada es la que está seleccionada.

Esto es lo que se ve en este paquete, como manejar los eventos de
foco, es decir, como hacer que se desencadene una acción cuando un
componente pues adquiere o pierde el foco, y tambien cuando una ventana
adquiere o pierde el foco.

Eventos de foco orientado a componentes:
#+BEGIN_EXAMPLE
		   +--------------------+	 +-------------------+
 		   |  FocusListener (I) |--------|  focusAdapter (C) |
		   +----------------+---+	 +-------------------+
				    |
				    |
+------------------------------+    |	   +---------------------------+
|focusGained(FocusEvent e) (M) |----+------|focusLost(FocusEvent e) (M)|
+------------------------------+	   +---------------------------+
#+END_EXAMPLE


Eventos de foco orientado a Ventana:
#+BEGIN_EXAMPLE
		       +-------------------------+   +-------------------+
		       |  WindowFocusListener (I)|---|  WindowAdapter (C)|
		       +-------------------------+   +-------------------+
				       |
				       |
+-----------------------------------+  |   +---------------------------------+
|windowGainedFocus(FocusEvent e) (M)|--+---|windowLostFocus(FocusEvent e) (M)|
+-----------------------------------+      +---------------------------------+
#+END_EXAMPLE

En este paquete se da un ejemplo de perdida y ganancia de foco con
componentes, haciendo que cuando un JTextField cambia hacia otro se
haga algo en la consola.

*** [[[https://www.youtube.com/watch?v%3DNvNZNEVWYO8&index%3D75&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video75]]] Eventos XI. Eventos de foco II
En este paquete se muestra la perdida y ganancia de foco pero con
ventanas. Se crean dos JFrames y que muestre un mensaje en la barra de
titulo el JFrame que tenga el foco.


** Multiples fuentes de eventos

*** [[[https://www.youtube.com/watch?v%3DYSCNtyNqizk&index%3D76&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video76]]] Eventos XII. Múltiples fuentes I
Por ejemplo cuando se quiere poner en negrita una palabra en
Word. Para esto puede haber dos fuentes. Una es el botón de
negrita. La otra fuente podría ser la tecla Ctrl+N. Entonces tenemos
dos fuentes para un mismo oyente que ejecute la acción de poner la
palabra en negrita.

Para esto se utiliza la interfaz =Action= de la API de Java.

#+BEGIN_EXAMPLE
 +-----------------------------------+	    +-----------+     +------------------+
 |actionPerformed(ActionEvent evento)|------|Action (I) |     | AbstractAction(C)|
 +-----------------------------------+	    +-----------+     +------------------+
					        |     
 +--------------------------+			|	+-----------------------+
 |setEnabled(boolean b) (M) |-------------------+-------|isEnable(boolean b) (M)|
 +--------------------------+		        |	+-----------------------+
					        |
 +----------------------------------------+     |      +----------------------------+
 |putValue(String clave, Object valor) (M)|-----+------| getValue(String clave) (M) |
 +----------------------------------------+     |      +----------------------------+
					        |
 +---------------------------------+	       	| 	+----------------------------------+
 |addPropertyChangedListener(Proper|            |       |removePropertyChangedListener(Pro |
 |tyChangedListener oyente) (M)    |------------+-------|pertyChangedListener oyente)  (M) |
 +---------------------------------+		 	+----------------------------------+
#+END_EXAMPLE

La clase =AbstractAction= implementa seis métodos de la interfaz
=Action=, y no implementa el método =actionPerformed(ActionEvent
e)=. Con esto, si no queremos programar los seis métodos al
implementar en alguna nuestra clase, lo que tendríamos que hacer, en
su lugar, es heredar de =AbstractAction= y luego sobre escribir el
método que queramos programar en nuestra clase.

En este paquete se crea un JPanel que tiene tres botones y pulsando en
cada uno de ellos el JPanel se pintara de un color dependiendo de que
botón fue pulsado. Esto es lo mismo de lo que se hizo en los paquetes
~video66~ y ~video67~ solo que, aquí, con la novedad de que también se
pintará si se realiza una combinación de teclas.

*** [[[https://www.youtube.com/watch?v%3D8FQnwZrr8Ck&index%3D77&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video77]]] Eventos XIII. Múltiples fuentes II
continua con el ejemplo del ~video76~. 

*** [[[https://www.youtube.com/watch?v%3DsY1CWJlqsSU&index%3D78&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video78]]] Eventos XIV. Múltiples fuentes III
continua con el ejemplo del ~video77~. Hasta es este punto se han
creado tres botones con una imagen, una descripción que aparece cuando
se pune el cursor sobre el botón y un texto. Cuando se da click a
culquier botón, se pinta el fondo con el color que indique el botón.

Faltaría pues (se hace en el siguiente video) que además de que el
fondo cambie cuando se le da click en el botón correspondiente,
también ejecute la acción cuando se presione cierta combinación de
teclas.

