src/readme.html

<div id="outline-container-sec-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> [<a href="https://www.youtube.com/watch?v=9Zflg2FnVjo&index=73&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video73</a>] Eventos IX. Eventos de ratón II</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Veremos que métodos y que campos de clase utilizar, pertenecientes a
la clase <code>MouseEvent</code>, pues para detectar cosas como por ejemplo:
dónde ha hecho click el usuario dentro de un componente, para saber
donde esta situado el ratón en un momento en concreto, para saber si
ha pulsado el botón izquierdo o derecho, cuantos clicks ha hecho. Todo
esto lo controlamos con métodos pertenecientes a la clase
<code>MouseEvent</code>.
</p>

<pre class="example">
		      +--------------------+
		      |   MouseEvent (C)   |
		      +-------+------------+
		     	      |
+-------------------+	      |	     +----------------------+
| BUTTON1_DOWN_MASK |---------+------| getX() (M)           |
+-------------------+	      |      +----------------------+
		     	      |      +----------------------+
		     	      |------| getY() (M)           |
+-------------------+	      |      +----------------------+
| BUTTON2_DOWN_MASK |---------+      +----------------------+
+-------------------+ 	      |------| getModifiersEx() (M) |
		     	      |      +----------------------+
		     	      |      +----------------------+
+-------------------+	      |------+ getClickCount() (M)  |
| BUTTON3_DOWN_MASK |---------+      +----------------------+
+-------------------+
</pre>

<p>
Hay otra interface muy interesante para controlar los eventos cuando
el ratón está en movimiento. Esta interface es
<code>MouseMotionListener</code>. En este paquete este se implementa con la clase
<code>EventoDeRatonMovimiento</code>.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Eventos de foco</h3>
<div class="outline-text-3" id="text-4-5">
</div><div id="outline-container-sec-4-5-1" class="outline-4">
<h4 id="sec-4-5-1"><span class="section-number-4">4.5.1</span> [<a href="https://www.youtube.com/watch?v=LMhk2Z7PcoE&index=74&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video74</a>] Eventos X. Eventos de foco I</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Por ejemplo cuando hay dos ventanas abiertas de una misma aplicación,
la ventana de foco o enfocada es la que está seleccionada.
</p>

<p>
Esto es lo que se ve en este paquete, como manejar los eventos de
foco, es decir, como hacer que se desencadene una acción cuando un
componente pues adquiere o pierde el foco, y tambien cuando una ventana
adquiere o pierde el foco.
</p>

<p>
Eventos de foco orientado a componentes:
</p>
<pre class="example">
		   +--------------------+	 +-------------------+
 		   |  FocusListener (I) |--------|  focusAdapter (C) |
		   +----------------+---+	 +-------------------+
				    |
				    |
+------------------------------+    |	   +---------------------------+
|focusGained(FocusEvent e) (M) |----+------|focusLost(FocusEvent e) (M)|
+------------------------------+	   +---------------------------+
</pre>


<p>
Eventos de foco orientado a Ventana:
</p>
<pre class="example">
		       +-------------------------+   +-------------------+
		       |  WindowFocusListener (I)|---|  WindowAdapter (C)|
		       +-------------------------+   +-------------------+
				       |
				       |
+-----------------------------------+  |   +---------------------------------+
|windowGainedFocus(FocusEvent e) (M)|--+---|windowLostFocus(FocusEvent e) (M)|
+-----------------------------------+      +---------------------------------+
</pre>

<p>
En este paquete se da un ejemplo de perdida y ganancia de foco con
componentes, haciendo que cuando un JTextField cambia hacia otro se
haga algo en la consola.
</p>
</div>
</div>

<div id="outline-container-sec-4-5-2" class="outline-4">
<h4 id="sec-4-5-2"><span class="section-number-4">4.5.2</span> [<a href="https://www.youtube.com/watch?v=NvNZNEVWYO8&index=75&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video75</a>] Eventos XI. Eventos de foco II</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
En este paquete se muestra la perdida y ganancia de foco pero con
ventanas. Se crean dos JFrames y que muestre un mensaje en la barra de
titulo el JFrame que tenga el foco.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Multiples fuentes de eventos</h3>
<div class="outline-text-3" id="text-4-6">
</div><div id="outline-container-sec-4-6-1" class="outline-4">
<h4 id="sec-4-6-1"><span class="section-number-4">4.6.1</span> [<a href="https://www.youtube.com/watch?v=YSCNtyNqizk&index=76&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video76</a>] Eventos XII. Múltiples fuentes I</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Por ejemplo cuando se quiere poner en negrita una palabra en
Word. Para esto puede haber dos fuentes. Una es el botón de
negrita. La otra fuente podría ser la tecla Ctrl+N. Entonces tenemos
dos fuentes para un mismo oyente que ejecute la acción de poner la
palabra en negrita.
</p>

<p>
Para esto se utiliza la interfaz <code>Action</code> de la API de Java.
</p>

<pre class="example">
+-----------------------------------+	    +-----------+     +------------------+
|actionPerformed(ActionEvent evento)|------|Action (I) |     | AbstractAction(C)|
+-----------------------------------+	    +-----------+     +------------------+
					       |     
+--------------------------+			|	+-----------------------+
|setEnabled(boolean b) (M) |-------------------+-------|isEnable(boolean b) (M)|
+--------------------------+		        |	+-----------------------+
					       |
+----------------------------------------+     |      +----------------------------+
|putValue(String clave, Object valor) (M)|-----+------| getValue(String clave) (M) |
+----------------------------------------+     |      +----------------------------+
					       |
+---------------------------------+	       	| 	+----------------------------------+
|addPropertyChangedListener(Proper|            |       |removePropertyChangedListener(Pro |
|tyChangedListener oyente) (M)    |------------+-------|pertyChangedListener oyente)  (M) |
+---------------------------------+		 	+----------------------------------+
</pre>

<p>
La clase <code>AbstractAction</code> implementa seis métodos de la interfaz
<code>Action</code>, y no implementa el método <code>actionPerformed(ActionEvent
e)</code>. Con esto, si no queremos programar los seis métodos al
implementar en alguna nuestra clase, lo que tendríamos que hacer, en
su lugar, es heredar de <code>AbstractAction</code> y luego sobre escribir el
método que queramos programar en nuestra clase.
</p>

<p>
En este paquete se crea un JPanel que tiene tres botones y pulsando en
cada uno de ellos el JPanel se pintara de un color dependiendo de que
botón fue pulsado. Esto es lo mismo de lo que se hizo en los paquetes
<code>video66</code> y <code>video67</code> solo que, aquí, con la novedad de que también se
pintará si se realiza una combinación de teclas.
</p>
</div>
</div>

<div id="outline-container-sec-4-6-2" class="outline-4">
<h4 id="sec-4-6-2"><span class="section-number-4">4.6.2</span> [<a href="https://www.youtube.com/watch?v=8FQnwZrr8Ck&index=77&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video77</a>] Eventos XIII. Múltiples fuentes II</h4>
<div class="outline-text-4" id="text-4-6-2">
<p>
continua con el ejemplo del <code>video76</code>. 
</p>
</div>
</div>

<div id="outline-container-sec-4-6-3" class="outline-4">
<h4 id="sec-4-6-3"><span class="section-number-4">4.6.3</span> [<a href="https://www.youtube.com/watch?v=sY1CWJlqsSU&index=78&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video78</a>] Eventos XIV. Múltiples fuentes III</h4>
<div class="outline-text-4" id="text-4-6-3">
<p>
continua con el ejemplo del <code>video77</code>. Hasta es este punto se han
creado tres botones con una imagen, una descripción que aparece cuando
se pune el cursor sobre el botón y un texto. Cuando se da click a
culquier botón, se pinta el fondo con el color que indique el botón.
</p>

<p>
Faltaría pues (se hace en el siguiente video) que además de que el
fondo cambie cuando se le da click en el botón correspondiente,
también ejecute la acción cuando se presione cierta combinación de
teclas.
</p>
</div>
</div>
