src/readme.org
*** [[[https://www.youtube.com/watch?v%3DNkyt5DT2mA0&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D79][video79]]] Eventos XV. Múltiples fuentes IV

Lo que se hace en este paquete es tener un objeto oyente, que seguirá
siendo el JPanel, pero tener dos objetos fuente, es decir, además de
el correspondiente botón, pues, también asignar como segundo objeto
fuente de evento, una combinación de eventos. Por ejemplo con Ctrl+A
se pinte el fondo de amarillo, con Ctrl+B de azul y Ctrl+R de rojo.

Con esto tendríamos que la acción de pintar el fondo del JPanel puede
realizarse de dos formas diferentes: desde sus botones
correspondientes y desde una combinación de teclas.

Los pasos ha seguir para realizar la asignación de acciones al teclado
son:

1. Crear mapa de entrada. Cual va a ser el objeto que tenga el foco,
   sobre que objeto va ha insidir la combinación de teclas. Las clases
   que se utilizan en este paso son: =InputMap=, =getInputMap(int
   condicion)= de la clase =JComponenet=.
2. Crear combinación de teclas. Las clases que se utiliza =static
   getKeyStroke(String s)= de la clase =KeyStroke=.
3. Asignar combinación de teclas a objeto. La clase que se utiliza:
   =put(KeyStroke, Object)=.
4. Asignar objeto a acción. Se utiliza =put(Object, accion)= de la
   clase =ActionMap=.

*** [[[https://www.youtube.com/watch?v%3DsmJg5QjlBpU&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D80][video80]]] Eventos XVI. Múltiples oyentes

#+BEGIN_EXAMPLE
							     +----------+
  +--------+						     | Oyente 1 |
  |Fuente 1|--					  evento   /-+----------+
  +--------+  \-evento				         /-  
	        \-				      /--    
		  \-				    /-	     
  +--------+  evento\+--------+		+--------+-- evento  +----------+
  |Fuente 2|---------| Oyente |		|Fuente 1|-----------|Oyente 2  |
  +--------+	    /+--------+		+--------+  	     +----------+
		  /-				  -\	     
	        /-				    -\ evento
	       /evento				      --\
  +--------+ /-						 -\  +----------+
  |Fuente 3|/						   --| Oyente 3 |
  +--------+						     +----------+
#+END_EXAMPLE

Siguiendo el ejemplo del ~video79~ teníamos un oyente que era el
JPanel que cambiaba de color. Teníamos dos fuentes. Una era el botón
del color correspondiente y la otra era el teclado.

Lo que se ve en este paquete es un escenario que es justamente lo
contrario. Es decir tener una unica fuente, esta fuente descencadena
un evento, y este evento es escuchado por varios oyentes.

Va a consistir en un marco (JFrame) que tendra dos botones. Un botón
nuevo y un botón de cerrar. Cuando pulsemos en el botón de /nuevo/ que
genere una ventana nueva. Cuando se presione el botón cerrar va ha
descencadenar un evento, este evento va ha ser escuchado por tres
oyentes diferentes (las ventanas abiertas con el botón /nuevo/).

* Layouts

** [[[https://www.youtube.com/watch?v%3DFr8lqCKwjmM&index%3D81&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video81]]] Layouts I. Componentes Swing
Se crean tres botones y se utiliza la clase =FlowLayout= para posicionar
los componenetes dentro de un JPanel que esta dentro del JFrame
principal.

** [[[https://www.youtube.com/watch?v%3DFAOGZuvvwrE&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D82][video82]]] Layouts II
Se crean cinco JButton's y se disponen en dos paneles llamados
~PanelLayout~ y ~PanelLayout2~ luego estos cinco botones se dispones
en los dos paneles y se les aplica diferentes disposiciones
=FlowLayout= y =BorderLayout=.

Por defecto los componentes se encuentran en disposición =FlowLayout=
y centrado.

** [[[https://www.youtube.com/watch?v%3DPy96zzymLA4&index%3D83&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video83]]] Layouts III
En este paquete se ve otra disposición denominada =GridLayout=, que lo
que hace es dejar nuestro contenedor en forma de rejilla. Es decir,
dejarlo en una especie de filas y columnas de tal forma nos quedan una
especie de celdas para colocar en ellos los componentes Swing.

El ejemplo para aplicar el =GridLayout= es una calculadora, el cual,
solo se deja hecho la interfaz gráfica, para continuar en el siguiente paquete.

** [[[https://www.youtube.com/watch?v%3DsT7UZM8yliE&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D84][video84]]] Layouts IV
Se continua con el ejemplo, iniciado en el paquete anterior, de
utilizar un =GridLayout= para realizar la interfaz gráfica de una
calculadora. En este paquete se le añade la funcionalidad a los
botones.

Esta funcionalidad consiste en que cuando se pulsa un número, se
muestre en la pantalla este número. Luego si se pulsa otro número se
concatena el texto anterior con el actual.

Los botones de operaciones (*,/,+,-) no se le agrega aún. Esto se hará
en el próximo paquete.

** [[[https://www.youtube.com/watch?v%3DQ2bzRMcE2Jk&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D85][video85]]] Layouts V
Se continua con la calculadora iniciada en el paquete ~video83~,
y siguida en ~video84~.

En este paquete se termina con la calculadora, poniendole
puncionalidad a los botones de operaciones (*,/,+,-).

* Componentes Swing

** Cuadros de texto
Cuando se dice "cuadros de texto" se puede referir a =JTextField= o
bien a =JPasswordfield=. Por cierto que el segundo hereda del
primero. Se caracterizan por tener una sola línea de texto.

*** [[[https://www.youtube.com/watch?v%3Dpl_FZDDDPZY&index%3D86&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video86]]] Cuadros de texto I

#+BEGIN_EXAMPLE
		      +----------------------+   
		      |  JTextComponent (CA) |   
		      +----------------------+   
				|	       
				|	       
+-----------------------+	| 	       	+----------------+
|void setText(String t) |-------+---------------| void getText() |
+-----------------------+    	| 		+----------------+
				|
				|
				|
				|
	 +---------------+	|	       +---------------+
	 | JTextField (C)|------+--------------| JTextArea (C) |
	 +---------------+		       +---------------+

(C): clase
(CA): clase abstracta
#+END_EXAMPLE

En este paquete se crea un marco el cual pone un =JTextField= y un
=JButton=. Cuando se le da click en el botón, captura el texto dentro
del =JTextfield= y lo imprime en consola. La continuación de este
ejemplo se realiza en el paquete ~video87~ para validar una dirección
de correo electrónico  en el =JTextField=.

*** [[[https://www.youtube.com/watch?v%3DFgt_ysSAXn8&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D87][video87]]] Cuadros de texto II
Se realiza la continuación del ejemplo el paquete ~video86~, y se le
extiende colocando una validación de una dirección de e-mail en
función de que si tiene '@' o no la tiene.

