src/readme.html

<div id="outline-container-sec-4-6-4" class="outline-4">
<h4 id="sec-4-6-4"><span class="section-number-4">4.6.4</span> [<a href="https://www.youtube.com/watch?v=Nkyt5DT2mA0&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=79">video79</a>] Eventos XV. Múltiples fuentes IV</h4>
<div class="outline-text-4" id="text-4-6-4">
<p>
Lo que se hace en este paquete es tener un objeto oyente, que seguirá
siendo el JPanel, pero tener dos objetos fuente, es decir, además de
el correspondiente botón, pues, también asignar como segundo objeto
fuente de evento, una combinación de eventos. Por ejemplo con Ctrl+A
se pinte el fondo de amarillo, con Ctrl+B de azul y Ctrl+R de rojo.
</p>

<p>
Con esto tendríamos que la acción de pintar el fondo del JPanel puede
realizarse de dos formas diferentes: desde sus botones
correspondientes y desde una combinación de teclas.
</p>

<p>
Los pasos ha seguir para realizar la asignación de acciones al teclado
son:
</p>

<ol class="org-ol">
<li>Crear mapa de entrada. Cual va a ser el objeto que tenga el foco,
sobre que objeto va ha insidir la combinación de teclas. Las clases
que se utilizan en este paso son: <code>InputMap</code>, <code>getInputMap(int
   condicion)</code> de la clase <code>JComponenet</code>.
</li>
<li>Crear combinación de teclas. Las clases que se utiliza <code>static
   getKeyStroke(String s)</code> de la clase <code>KeyStroke</code>.
</li>
<li>Asignar combinación de teclas a objeto. La clase que se utiliza:
<code>put(KeyStroke, Object)</code>.
</li>
<li>Asignar objeto a acción. Se utiliza <code>put(Object, accion)</code> de la
clase <code>ActionMap</code>.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4-6-5" class="outline-4">
<h4 id="sec-4-6-5"><span class="section-number-4">4.6.5</span> [<a href="https://www.youtube.com/watch?v=smJg5QjlBpU&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=80">video80</a>] Eventos XVI. Múltiples oyentes</h4>
<div class="outline-text-4" id="text-4-6-5">
<pre class="example">
							   +----------+
+--------+						     | Oyente 1 |
|Fuente 1|--					  evento   /-+----------+
+--------+  \-evento				         /-  
	      \-				      /--    
		\-				    /-	     
+--------+  evento\+--------+		+--------+-- evento  +----------+
|Fuente 2|---------| Oyente |		|Fuente 1|-----------|Oyente 2  |
+--------+	    /+--------+		+--------+  	     +----------+
		/-				  -\	     
	      /-				    -\ evento
	     /evento				      --\
+--------+ /-						 -\  +----------+
|Fuente 3|/						   --| Oyente 3 |
+--------+						     +----------+
</pre>

<p>
Siguiendo el ejemplo del <code>video79</code> teníamos un oyente que era el
JPanel que cambiaba de color. Teníamos dos fuentes. Una era el botón
del color correspondiente y la otra era el teclado.
</p>

<p>
Lo que se ve en este paquete es un escenario que es justamente lo
contrario. Es decir tener una unica fuente, esta fuente descencadena
un evento, y este evento es escuchado por varios oyentes.
</p>

<p>
Va a consistir en un marco (JFrame) que tendra dos botones. Un botón
nuevo y un botón de cerrar. Cuando pulsemos en el botón de <i>nuevo</i> que
genere una ventana nueva. Cuando se presione el botón cerrar va ha
descencadenar un evento, este evento va ha ser escuchado por tres
oyentes diferentes (las ventanas abiertas con el botón <i>nuevo</i>).
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Layouts</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> [<a href="https://www.youtube.com/watch?v=Fr8lqCKwjmM&index=81&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video81</a>] Layouts I. Componentes Swing</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Se crean tres botones y se utiliza la clase <code>FlowLayout</code> para posicionar
los componenetes dentro de un JPanel que esta dentro del JFrame
principal.
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> [<a href="https://www.youtube.com/watch?v=FAOGZuvvwrE&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=82">video82</a>] Layouts II</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Se crean cinco JButton's y se disponen en dos paneles llamados
<code>PanelLayout</code> y <code>PanelLayout2</code> luego estos cinco botones se dispones
en los dos paneles y se les aplica diferentes disposiciones
<code>FlowLayout</code> y <code>BorderLayout</code>.
</p>

<p>
Por defecto los componentes se encuentran en disposición <code>FlowLayout</code>
y centrado.
</p>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> [<a href="https://www.youtube.com/watch?v=Py96zzymLA4&index=83&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video83</a>] Layouts III</h3>
<div class="outline-text-3" id="text-5-3">
<p>
En este paquete se ve otra disposición denominada <code>GridLayout</code>, que lo
que hace es dejar nuestro contenedor en forma de rejilla. Es decir,
dejarlo en una especie de filas y columnas de tal forma nos quedan una
especie de celdas para colocar en ellos los componentes Swing.
</p>

<p>
El ejemplo para aplicar el <code>GridLayout</code> es una calculadora, el cual,
solo se deja hecho la interfaz gráfica, para continuar en el siguiente paquete.
</p>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> [<a href="https://www.youtube.com/watch?v=sT7UZM8yliE&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=84">video84</a>] Layouts IV</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Se continua con el ejemplo, iniciado en el paquete anterior, de
utilizar un <code>GridLayout</code> para realizar la interfaz gráfica de una
calculadora. En este paquete se le añade la funcionalidad a los
botones.
</p>

<p>
Esta funcionalidad consiste en que cuando se pulsa un número, se
muestre en la pantalla este número. Luego si se pulsa otro número se
concatena el texto anterior con el actual.
</p>

<p>
Los botones de operaciones (*,/,+,-) no se le agrega aún. Esto se hará
en el próximo paquete.
</p>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> [<a href="https://www.youtube.com/watch?v=Q2bzRMcE2Jk&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=85">video85</a>] Layouts V</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Se continua con la calculadora iniciada en el paquete <code>video83</code>,
y siguida en <code>video84</code>.
</p>

<p>
En este paquete se termina con la calculadora, poniendole
puncionalidad a los botones de operaciones (*,/,+,-).
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Componentes Swing</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Cuadros de texto</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Cuando se dice "cuadros de texto" se puede referir a <code>JTextField</code> o
bien a <code>JPasswordfield</code>. Por cierto que el segundo hereda del
primero. Se caracterizan por tener una sola línea de texto.
</p>
</div>

<div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> [<a href="https://www.youtube.com/watch?v=pl_FZDDDPZY&index=86&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video86</a>] Cuadros de texto I</h4>
<div class="outline-text-4" id="text-6-1-1">
<pre class="example">
		      +----------------------+   
		      |  JTextComponent (CA) |   
		      +----------------------+   
				|	       
				|	       
+-----------------------+	| 	       	+----------------+
|void setText(String t) |-------+---------------| void getText() |
+-----------------------+    	| 		+----------------+
				|
				|
				|
				|
	 +---------------+	|	       +---------------+
	 | JTextField (C)|------+--------------| JTextArea (C) |
	 +---------------+		       +---------------+

(C): clase
(CA): clase abstracta
</pre>

<p>
En este paquete se crea un marco el cual pone un <code>JTextField</code> y un
<code>JButton</code>. Cuando se le da click en el botón, captura el texto dentro
del <code>JTextfield</code> y lo imprime en consola. La continuación de este
ejemplo se realiza en el paquete <code>video87</code> para validar una dirección
de correo electrónico  en el <code>JTextField</code>.
</p>
</div>
</div>

<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> [<a href="https://www.youtube.com/watch?v=Fgt_ysSAXn8&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=87">video87</a>] Cuadros de texto II</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Se realiza la continuación del ejemplo el paquete <code>video86</code>, y se le
extiende colocando una validación de una dirección de e-mail en
función de que si tiene '@' o no la tiene.
</p>
</div>
</div>
