src/readme.org
*** [[[https://www.youtube.com/watch?v%3D-Q_gHYLTRPQ&index%3D88&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video88]]] Eventos en cuadros de texto I
Cambios en un =JTextField=. ¿Cómo gestionamos el evento?

#+BEGIN_EXAMPLE
 +-------------------+						      +-------------------+
 |JTextComponent (CA)|--------+			            +---------|ReceptoraEvento (C)|
 +-------------------+	      |				    |	      +-------------------+
	   |		+-------------+		 +---------------------+
	   | 		|getDocument()|		 | DocumentListener (I)|
	   | 		+-------------+		 +---------+-----------+
	   |						   |	   
    +--------------+					   |	   +--------------+
    |JTextField (C)|	      +-------+			   +-------|removeUpdate()|
    +--------------+	      | ---  \|			   |	   +--------------+
			      | ---   |			   |	   +---------------+
			      | ---   |			   +-------|insertUpdate() |
			      +-------+			   |	   +---------------+
 +---------------------+    +------------+		   |	   +---------------+
 |addDocumentListener()|----|Document (I)|		   +-------|changedUpdate()|
 +---------------------+    +------------+			   +---------------+

CA: clase abstracta
I: interface
C: clase
#+END_EXAMPLE

~Document~ es una representación del texto que tiene el =JTextField=.

El método =removeUpdate()= se ejecuta cuando dentro del =JTextField=
se elimina texto.

El método =insertUpdate()= se ejecuta cuando dentro del =JTextField=
se inserta texto.

El método =changedUpdate()= se ejecuta, cuando el textro dentro del
=JTextField=, modifica alguna de sus propiedades (negritas, cursiva,
tamaños, etc).

La clase =JTextField= tiene el método =getDocument()= que aplicandolo
sobre un objeto =JTextField= lo que hace es devolvernos un =Document=
y a ese =Document= le podemos aplicar el método =addDocumentListener=.

En este paquete se crea un =JFrame= con un =JPanel= conteniendo un
=JTextfield=. A este último se le pone ha la escucha para que muestre
por consola cuando se ha añadido texto y cuando se le ha borrado texto
al mismo.

*** [[[https://www.youtube.com/watch?v%3DuQWVgMeOeHw&index%3D89&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video89]]] Eventos en cuadros de texto II
Se labora un ejemplo un poco más práctico con eventos para cuadros de
texto. Una aplicación gráfica que tenga un nombre de usuario, una
constraseña, esa contraseña deba de contener entre 8 y 12 caracteres y
en caso de que estemos introduciendo una contraseña con caracteres
incorrectos, pues, que la aplicación gráfica nos avise. 

El control para el cuadro de texto para contraseña es un
=JPasswordField=.

Mientras no se cumple el requisito que se muestre el fondo del
=JPasswordField= en rojo y cambie a blanco cuando ya cumpla.

** Áreas de texto
Cuando se dice "áreas de texto" refiere a =JTextArea=. Se
caracterizan por admitir varias líneas de texto.

*** [[[https://www.youtube.com/watch?v%3DqVDzPPUfpLI&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D90][video90]]] Áreas de texto I
#+BEGIN_EXAMPLE
		       +---------------+		      
	+--------------+ JTextArea (C) |-----------------------
	|              +---------------+		      |
	|			|			      |
	|			|			      |
 +-----------+	     +---------------------+	       +---------------+
 | getText() |	     | setLineWrap(boolean)| 	       | getLineWrap() |
 +-----------+	     +---------------------+	       +---------------+

(C): clase
#+END_EXAMPLE

El método =getText()= devulve el texto que hay escrito en el área de
texto.

El método =setLineWrap()= establece si el área de texto tiene saltos
de línea o no los tiene.

El método =getLineWrap()= nos dice si el área de texto que estamos
evaluando tiene o no tiene saltos de línea.

Se contruye en un =JFrame= que tiene un =JPanel= con un
=JTextArea=. En el último el usuario escribirá. A continuación un
botón que pulsando en él nos pondrá en consola el texto que tiene el
área de texto.

*** [[[https://www.youtube.com/watch?v%3DeOblXyMw9wE&index%3D91&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video91]]] Áreas de texto II
Un ejemplo un poco más complejo. Se crea un =JTextArea= en la zona
central. En la parte inferior va un botón que inserta un texto por
defecto. Un segundo botón que quitará saltos de línea en el área de
texto.

Se incluye un /concepto nuevo/ respecto a los layouts que es establecer
un layout en el propio =JFrame= y no en un =Jpanel=, como se ha echo en
los anteriores paquetes, sin agregar =JPanel=.

Otra de las caracteristicas, en la codificación de este paquete, es
que no se crean clases por aparte para las clases oyentes de los
eventos de los botones, sino más bien se realiza todo en una clase.

** CheckBox

*** [[[https://www.youtube.com/watch?v%3DV-hmPZ8pDkM&index%3D92&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video92]]] CheckBox
#+BEGIN_EXAMPLE
		   +------------------+			
		   |  	              |			
	 +---------+   JCheckBox (C)  |----------------+
	 |	   |                  |		       |
	 |	   +------------------+		       |
	 |					       |
  +-------------+			      +---------------------+
  | isSelected()|			      | setSelected(boolean)|
  +-------------+			      +---------------------+

 (C): clase
#+END_EXAMPLE    

Estos dos métodos los hereda de =javax.swing.AbstractButton=. 

=isSelected()= permite determinar si la casilla de verificación estás
seleccionada o no lo está.

=setSelected()= permite seleccionar, desde código, seleccionar esa
casilla o no seleccionarlo.

En este paquete se establece un texto en la parte superior del marco y
luego en la parte inferior de este marco que aparezcan los dos
checkbox.

Estos checkbox permiten modificar algunas características del texto
que esta arriba, por ejemplo, el checkbox en la parte izquierda
inferior va ha establecer letra negrita para el texto. El otro
checkbox hace lo mismo pero con cursiva.

** Botones de radio

