src/readme.html

<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> [<a href="https://www.youtube.com/watch?v=-Q_gHYLTRPQ&index=88&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video88</a>] Eventos en cuadros de texto I</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
Cambios en un <code>JTextField</code>. ¿Cómo gestionamos el evento?
</p>

<pre class="example">
 +-------------------+						      +-------------------+
 |JTextComponent (CA)|--------+			            +---------|ReceptoraEvento (C)|
 +-------------------+	      |				    |	      +-------------------+
	   |		+-------------+		 +---------------------+
	   | 		|getDocument()|		 | DocumentListener (I)|
	   | 		+-------------+		 +---------+-----------+
	   |						   |	   
    +--------------+					   |	   +--------------+
    |JTextField (C)|	      +-------+			   +-------|removeUpdate()|
    +--------------+	      | ---  \|			   |	   +--------------+
			      | ---   |			   |	   +---------------+
			      | ---   |			   +-------|insertUpdate() |
			      +-------+			   |	   +---------------+
 +---------------------+    +------------+		   |	   +---------------+
 |addDocumentListener()|----|Document (I)|		   +-------|changedUpdate()|
 +---------------------+    +------------+			   +---------------+

CA: clase abstracta
I: interface
C: clase
</pre>

<p>
<code>Document</code> es una representación del texto que tiene el <code>JTextField</code>.
</p>

<p>
El método <code>removeUpdate()</code> se ejecuta cuando dentro del <code>JTextField</code>
se elimina texto.
</p>

<p>
El método <code>insertUpdate()</code> se ejecuta cuando dentro del <code>JTextField</code>
se inserta texto.
</p>

<p>
El método <code>changedUpdate()</code> se ejecuta, cuando el textro dentro del
<code>JTextField</code>, modifica alguna de sus propiedades (negritas, cursiva,
tamaños, etc).
</p>

<p>
La clase <code>JTextField</code> tiene el método <code>getDocument()</code> que aplicandolo
sobre un objeto <code>JTextField</code> lo que hace es devolvernos un <code>Document</code>
y a ese <code>Document</code> le podemos aplicar el método <code>addDocumentListener</code>.
</p>

<p>
En este paquete se crea un <code>JFrame</code> con un <code>JPanel</code> conteniendo un
<code>JTextfield</code>. A este último se le pone ha la escucha para que muestre
por consola cuando se ha añadido texto y cuando se le ha borrado texto
al mismo.
</p>
</div>
</div>

<div id="outline-container-sec-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> [<a href="https://www.youtube.com/watch?v=uQWVgMeOeHw&index=89&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video89</a>] Eventos en cuadros de texto II</h4>
<div class="outline-text-4" id="text-6-1-4">
<p>
Se labora un ejemplo un poco más práctico con eventos para cuadros de
texto. Una aplicación gráfica que tenga un nombre de usuario, una
constraseña, esa contraseña deba de contener entre 8 y 12 caracteres y
en caso de que estemos introduciendo una contraseña con caracteres
incorrectos, pues, que la aplicación gráfica nos avise. 
</p>

<p>
El control para el cuadro de texto para contraseña es un
<code>JPasswordField</code>.
</p>

<p>
Mientras no se cumple el requisito que se muestre el fondo del
<code>JPasswordField</code> en rojo y cambie a blanco cuando ya cumpla.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Áreas de texto</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Cuando se dice "áreas de texto" refiere a <code>JTextArea</code>. Se
caracterizan por admitir varias líneas de texto.
</p>
</div>

<div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> [<a href="https://www.youtube.com/watch?v=qVDzPPUfpLI&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=90">video90</a>] Áreas de texto I</h4>
<div class="outline-text-4" id="text-6-2-1">
<pre class="example">
		       +---------------+		      
	+--------------+ JTextArea (C) |-----------------------
	|              +---------------+		      |
	|			|			      |
	|			|			      |
 +-----------+	     +---------------------+	       +---------------+
 | getText() |	     | setLineWrap(boolean)| 	       | getLineWrap() |
 +-----------+	     +---------------------+	       +---------------+

(C): clase
</pre>

<p>
El método <code>getText()</code> devulve el texto que hay escrito en el área de
texto.
</p>

<p>
El método <code>setLineWrap()</code> establece si el área de texto tiene saltos
de línea o no los tiene.
</p>

<p>
El método <code>getLineWrap()</code> nos dice si el área de texto que estamos
evaluando tiene o no tiene saltos de línea.
</p>

<p>
Se contruye en un <code>JFrame</code> que tiene un <code>JPanel</code> con un
<code>JTextArea</code>. En el último el usuario escribirá. A continuación un
botón que pulsando en él nos pondrá en consola el texto que tiene el
área de texto.
</p>
</div>
</div>

<div id="outline-container-sec-6-2-2" class="outline-4">
<h4 id="sec-6-2-2"><span class="section-number-4">6.2.2</span> [<a href="https://www.youtube.com/watch?v=eOblXyMw9wE&index=91&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video91</a>] Áreas de texto II</h4>
<div class="outline-text-4" id="text-6-2-2">
<p>
Un ejemplo un poco más complejo. Se crea un <code>JTextArea</code> en la zona
central. En la parte inferior va un botón que inserta un texto por
defecto. Un segundo botón que quitará saltos de línea en el área de
texto.
</p>

<p>
Se incluye un <i>concepto nuevo</i> respecto a los layouts que es establecer
un layout en el propio <code>JFrame</code> y no en un <code>Jpanel</code>, como se ha echo en
los anteriores paquetes, sin agregar <code>JPanel</code>.
</p>

<p>
Otra de las caracteristicas, en la codificación de este paquete, es
que no se crean clases por aparte para las clases oyentes de los
eventos de los botones, sino más bien se realiza todo en una clase.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> CheckBox</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> [<a href="https://www.youtube.com/watch?v=V-hmPZ8pDkM&index=92&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video92</a>] CheckBox</h4>
<div class="outline-text-4" id="text-6-3-1">
<pre class="example">
		  +------------------+			
		  |  	              |			
	+---------+   JCheckBox (C)  |----------------+
	|	   |                  |		       |
	|	   +------------------+		       |
	|					       |
 +-------------+			      +---------------------+
 | isSelected()|			      | setSelected(boolean)|
 +-------------+			      +---------------------+

(C): clase
</pre>

<p>
Estos dos métodos los hereda de <code>javax.swing.AbstractButton</code>. 
</p>

<p>
<code>isSelected()</code> permite determinar si la casilla de verificación estás
seleccionada o no lo está.
</p>

<p>
<code>setSelected()</code> permite seleccionar, desde código, seleccionar esa
casilla o no seleccionarlo.
</p>

<p>
En este paquete se establece un texto en la parte superior del marco y
luego en la parte inferior de este marco que aparezcan los dos
checkbox.
</p>

<p>
Estos checkbox permiten modificar algunas características del texto
que esta arriba, por ejemplo, el checkbox en la parte izquierda
inferior va ha establecer letra negrita para el texto. El otro
checkbox hace lo mismo pero con cursiva.
</p>
</div>
</div>
</div>
