src/readme.org
*** [[[https://www.youtube.com/watch?v%3DCWl3ihbT4I0&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D93][video93]]] Botones de radio I
Los botones de radio son como los checkbox pero redondos. La
diferencia esta en que los checkbox puedes seleccionar varios a la
vez, mientras que los botones de radio solo una unica entre varias.


Clases implicadas para construir este tipo de objetos
#+BEGIN_EXAMPLE
+------------------+		  +------------------+
| JRadioButton (C) |		  |  ButtonGroup (C) |
+------------------+		  +------------------+
						      
       O Azul			    +-----------------+
				    |	  O Azul      |
       O Verde			    |         	      |
				    |     O Verde     |
       O Rojo			    |		      |
				    |     O Rojo      |
				    |		      |
				    +-----------------+
#+END_EXAMPLE

=JRadioButton= no permite construir uno de estos elementos, luego para
adquirir el comportamiento de que solo uno es posible seleccionar, es
menester utilizar la clase =Buttongroup=.

En este paquete se crean dos grupos de botones de radio. El primer
grupo son: azul, verde y rojo. El segundo grupo son: masculino y
feminino. Solo se crean las interfaces gráficas sin funcionalidad.

*** [[[https://www.youtube.com/watch?v%3DDxrcffniQKQ&index%3D94&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video94]]] Botones de radio II

En el centro del marco se coloca un texto.

En la parte inferior cuatro botones de radio etiquetados con pequeño,
mediano, grande y muy grande. Cuando se pulsa en algun boton de radio
el texto central cambia de tamaño conforme su etiqueta lo indique.

** ComboBox
*** [[[https://www.youtube.com/watch?v%3DMYdAW9f7YHk&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D95][video95]]] ComboBox

#+BEGIN_EXAMPLE
		    +----------------+		      
       +------------|  JComboBox (C) |---------------+
       |	    +----------------+		     |
       |					     |
       |					     |
  +-----------+				   +--------------------+
  | addItem() |				   |  getSelectedItem() |
  +-----------+				   +--------------------+

(C): clase
#+END_EXAMPLE

=addItem()= no permite agregar elementos al menú desplegable

=getSelectedItem()= no permite obtener el elemento seleccionado.

En este paquete se crea un =JComboBox= en la parte superior
conteniendo un listado de tipos de letra. 

En el centro ira un texto por defecto.

Cuando se selecciona un tipo de letra del =JComboBox= el texto central
cambia de tipo de fuente de acuerdo al seleccionado.

Además, al =JCombobox= se le establece como editable, mediante el
método =setEditable(true)=, para hacer que el usuario pueda escribir
la fuente que quiera y luego presionar enter para que cambie el texto
central a ese tipo de fuente.

IMPORTANTE: las fuentes listadas en el =JComboBox= son del sistema
GNU/Linux por lo que si se quiere ejecutar en Windows se tendrá que
cambiar estos tipos de fuente listados en el =JCombobox= o de lo
contrario no realizará ninguna acción con se elija algún item.

** JSlider

*** [[[https://www.youtube.com/watch?v%3DXtoSO1yXgSc&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D96][video96]]] JSlider I
Los JSlider también conocidos como controles deslizantes. Es el tipo
control que se puede deslizar de izquierda a derecha.

#+BEGIN_EXAMPLE
 	               	 			+-----------------+
                                       		|                 |
             +----------------------------------|    JSlider (C)  |------------------------------------+
             |                                  |                 |                                    |
             |                   	        +-----------------+	     			       |
             | 		 	            		 | 		        		       |
 	     | 		 		                 |        	  			       |
 	     | 		 		  +--------------+----------------+			       |
 	     | 		 		  |	                	  |			       |
 +----------------------+     +-------------------------+   +------------------------+ 	   +-----------+------------+
 |setPaintTicks(boolean)|     |setMajorTickSpacing(int) |   |setMinorTickSpacing(int)| 	   | setPaintLabels(boolean)|
 +----------------------+     +-------------------------+   +------------------------+ 	   +------------------------+

(C): clase
#+END_EXAMPLE

El método =setPaintTicks= se utiliza para imprimier las lineas de
división.

El método =setPaintLabels= se utiliza para que se impriman los valores
numéricos.

Los métodos =setMajorTickSpacing= y =setMinorTickSpacing= se utilizan
para determinar de cuanto en cuanto van las marcas.

En este paquete se crea un =JSlider= sin funcionalidad solo interfaz
gráfica.

*** [[[https://www.youtube.com/watch?v%3D3IV2SKV6H80&index%3D97&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video97]]] JSlider II
Lo que vamos ha ver en este paquete es como agregar intactividad ha
este componenete, es decir, arrastrando el =JSlider= responda a
eventos, o desencadene acciones mejor dicho. Se comienza con lo hecho
en el paquete anterior ~video96~.

Especificamente se crean un =JSlider= en la parte superior y un texto
central. A medida que cambie el =JSlider=, también lo hará en tamaño
del texto central.

Para controlar eventos el =JSlider= tiene el método
=addChangedListener(ChangeListener)=.

** JSpinner

