src/readme.html

<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> Botones de radio</h3>
<div class="outline-text-3" id="text-6-4">
</div><div id="outline-container-sec-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> [<a href="https://www.youtube.com/watch?v=CWl3ihbT4I0&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=93">video93</a>] Botones de radio I</h4>
<div class="outline-text-4" id="text-6-4-1">
<p>
Los botones de radio son como los checkbox pero redondos. La
diferencia esta en que los checkbox puedes seleccionar varios a la
vez, mientras que los botones de radio solo una unica entre varias.
</p>


<p>
Clases implicadas para construir este tipo de objetos
</p>
<pre class="example">
+------------------+		  +------------------+
| JRadioButton (C) |		  |  ButtonGroup (C) |
+------------------+		  +------------------+
						      
       O Azul			    +-----------------+
				    |	  O Azul      |
       O Verde			    |         	      |
				    |     O Verde     |
       O Rojo			    |		      |
				    |     O Rojo      |
				    |		      |
				    +-----------------+
</pre>

<p>
<code>JRadioButton</code> no permite construir uno de estos elementos, luego para
adquirir el comportamiento de que solo uno es posible seleccionar, es
menester utilizar la clase <code>Buttongroup</code>.
</p>

<p>
En este paquete se crean dos grupos de botones de radio. El primer
grupo son: azul, verde y rojo. El segundo grupo son: masculino y
feminino. Solo se crean las interfaces gráficas sin funcionalidad.
</p>
</div>
</div>

<div id="outline-container-sec-6-4-2" class="outline-4">
<h4 id="sec-6-4-2"><span class="section-number-4">6.4.2</span> [<a href="https://www.youtube.com/watch?v=DxrcffniQKQ&index=94&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video94</a>] Botones de radio II</h4>
<div class="outline-text-4" id="text-6-4-2">
<p>
En el centro del marco se coloca un texto.
</p>

<p>
En la parte inferior cuatro botones de radio etiquetados con pequeño,
mediano, grande y muy grande. Cuando se pulsa en algun boton de radio
el texto central cambia de tamaño conforme su etiqueta lo indique.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> ComboBox</h3>
<div class="outline-text-3" id="text-6-5">
</div><div id="outline-container-sec-6-5-1" class="outline-4">
<h4 id="sec-6-5-1"><span class="section-number-4">6.5.1</span> [<a href="https://www.youtube.com/watch?v=MYdAW9f7YHk&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=95">video95</a>] ComboBox</h4>
<div class="outline-text-4" id="text-6-5-1">
<pre class="example">
		    +----------------+		      
       +------------|  JComboBox (C) |---------------+
       |	    +----------------+		     |
       |					     |
       |					     |
  +-----------+				   +--------------------+
  | addItem() |				   |  getSelectedItem() |
  +-----------+				   +--------------------+

(C): clase
</pre>

<p>
<code>addItem()</code> no permite agregar elementos al menú desplegable
</p>

<p>
<code>getSelectedItem()</code> no permite obtener el elemento seleccionado.
</p>

<p>
En este paquete se crea un <code>JComboBox</code> en la parte superior
conteniendo un listado de tipos de letra. 
</p>

<p>
En el centro ira un texto por defecto.
</p>

<p>
Cuando se selecciona un tipo de letra del <code>JComboBox</code> el texto central
cambia de tipo de fuente de acuerdo al seleccionado.
</p>

<p>
Además, al <code>JCombobox</code> se le establece como editable, mediante el
método <code>setEditable(true)</code>, para hacer que el usuario pueda escribir
la fuente que quiera y luego presionar enter para que cambie el texto
central a ese tipo de fuente.
</p>

<p>
IMPORTANTE: las fuentes listadas en el <code>JComboBox</code> son del sistema
GNU/Linux por lo que si se quiere ejecutar en Windows se tendrá que
cambiar estos tipos de fuente listados en el <code>JCombobox</code> o de lo
contrario no realizará ninguna acción con se elija algún item.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6-6" class="outline-3">
<h3 id="sec-6-6"><span class="section-number-3">6.6</span> JSlider</h3>
<div class="outline-text-3" id="text-6-6">
</div><div id="outline-container-sec-6-6-1" class="outline-4">
<h4 id="sec-6-6-1"><span class="section-number-4">6.6.1</span> [<a href="https://www.youtube.com/watch?v=XtoSO1yXgSc&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=96">video96</a>] JSlider I</h4>
<div class="outline-text-4" id="text-6-6-1">
<p>
Los JSlider también conocidos como controles deslizantes. Es el tipo
control que se puede deslizar de izquierda a derecha.
</p>

<pre class="example">
 	               	 			+-----------------+
                                       		|                 |
             +----------------------------------|    JSlider (C)  |------------------------------------+
             |                                  |                 |                                    |
             |                   	        +-----------------+	     			       |
             | 		 	            		 | 		        		       |
 	     | 		 		                 |        	  			       |
 	     | 		 		  +--------------+----------------+			       |
 	     | 		 		  |	                	  |			       |
 +----------------------+     +-------------------------+   +------------------------+ 	   +-----------+------------+
 |setPaintTicks(boolean)|     |setMajorTickSpacing(int) |   |setMinorTickSpacing(int)| 	   | setPaintLabels(boolean)|
 +----------------------+     +-------------------------+   +------------------------+ 	   +------------------------+

(C): clase
</pre>

<p>
El método <code>setPaintTicks</code> se utiliza para imprimier las lineas de
división.
</p>

<p>
El método <code>setPaintLabels</code> se utiliza para que se impriman los valores
numéricos.
</p>

<p>
Los métodos <code>setMajorTickSpacing</code> y <code>setMinorTickSpacing</code> se utilizan
para determinar de cuanto en cuanto van las marcas.
</p>

<p>
En este paquete se crea un <code>JSlider</code> sin funcionalidad solo interfaz
gráfica.
</p>
</div>
</div>

<div id="outline-container-sec-6-6-2" class="outline-4">
<h4 id="sec-6-6-2"><span class="section-number-4">6.6.2</span> [<a href="https://www.youtube.com/watch?v=3IV2SKV6H80&index=97&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video97</a>] JSlider II</h4>
<div class="outline-text-4" id="text-6-6-2">
<p>
Lo que vamos ha ver en este paquete es como agregar intactividad ha
este componenete, es decir, arrastrando el <code>JSlider</code> responda a
eventos, o desencadene acciones mejor dicho. Se comienza con lo hecho
en el paquete anterior <code>video96</code>.
</p>

<p>
Especificamente se crean un <code>JSlider</code> en la parte superior y un texto
central. A medida que cambie el <code>JSlider</code>, también lo hará en tamaño
del texto central.
</p>

<p>
Para controlar eventos el <code>JSlider</code> tiene el método
<code>addChangedListener(ChangeListener)</code>.
</p>
</div>
</div>
</div>
