src/readme.org
*** [[[https://www.youtube.com/watch?v%3D06acFKm-kcQ&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index%3D98][video98]]] JSpinner I
Es un cuadro de texto con dos botones a la derecha que normalmente
contiene datos de tipo número, para aumentar o disminuir los números
con estos botones.

Para crear un control con estas características se usa

#+BEGIN_EXAMPLE
		+------------------+					   
		|                  |					   
        +-------|     JSpinner (C) |-------------------+		   
	|	|                  |		       |		   
	|	+------------------+		       |		   
	|			 		       |		   
	|			 		       |		   
	|			 		       |		   
	|			 		       |		   
  +--------------+		       +----------------------------------+
  |Jspinner() (c)|		       | Jspinner(SpinnerModel modelo) (c)|
  +--------------+		       +----------------------------------+

(C) : clase 
(c) : constructor
#+END_EXAMPLE 

Cuando se crea con el constructor por defecto =JSpinner()=, los
valores son numéricos del 0 al infinito.

Si se utiliza el segundo constructor =JSpinner(SpinnerModel modelo)=
se puede modelar de tal forma que en vez de valores numéricos puedan
ser de otros tipos como:

- fechas (se usa la clase =SpinnerDateModel=)
- valores de texto (se usa la clase =SpinnerListModel=)

En este paquete se crean cuatro =JSpinner= utilizando las diferentes
clases:

- JSpinner de lista :: cuatro primeros meses del mes utilizando
     =SpinnerListModel=.
- JSpinner de fecha :: manipula fechas
- JSpinner de lista de fuentes del sistema :: utiliza la misma clase
     =SpinnerListModel= solo que la lista de cadenas es las fuentes
     del sistema.
- JSpinner de números :: maneja números como lo hace por defecto solo
     que se utiliza la clase =SpinnerNumberModel= para tener un mejor
     control. Aqui se le indica que comienze en cinco y vaya de dos en
     dos. Como tope inferior se le indica a 0 y como tope superior se
     le indica a 10

Se colocaro estos controles solo para probar la interfaz que
proporciona =JSpinner=. No se le añade Eventos. Los eventos con
JSpinner se tratan en el siguiente paquete (~video99~).


*** [[[https://www.youtube.com/watch?v%3DnOisCjNznaE&index%3D99&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video99]]] JSpinner II

Se cambia el modelo del =JSpinner= para que, cuando se pulse el botón
de arriba, se decremente en vez de incrementar y cuando se pulse el
botón de abajo se incremente.

Para hacer esto tenemos que crear nuestro propio modelo, porque en
ninguno de los modelos, que podemos utilizar por defecto en java
(=SpinnerListModel=, =SpinnerDateModel=, =SpinnerNumberModel=), hace
que este comportamiento cambie.

En este paquete tambien se trata en concepto nuevo, muy importante y
quizá complejo: *las clases internas anónimas*.

** [[[https://www.youtube.com/watch?v%3DL_QzjDWoKDo&index%3D100&list%3DPLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk][video100]]] Creación de menús I
Para construir menús Swing, dentro de una aplicación Java, tenemos que
manejar fundamentalmente las clases:
- =JMenuBar=
- =JMenu=
- =JMenuItem=

El =JMenuBar= sirve como elemento de soporte en donde se colocarán los
objetos de =JMenu=. Y dentro de =JMenu= irán objetos de =JMenuItem=
para formar una especie de pestañas.

