src/readme.html

<div id="outline-container-sec-6-7" class="outline-3">
<h3 id="sec-6-7"><span class="section-number-3">6.7</span> JSpinner</h3>
<div class="outline-text-3" id="text-6-7">
</div><div id="outline-container-sec-6-7-1" class="outline-4">
<h4 id="sec-6-7-1"><span class="section-number-4">6.7.1</span> [<a href="https://www.youtube.com/watch?v=06acFKm-kcQ&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk&index=98">video98</a>] JSpinner I</h4>
<div class="outline-text-4" id="text-6-7-1">
<p>
Es un cuadro de texto con dos botones a la derecha que normalmente
contiene datos de tipo número, para aumentar o disminuir los números
con estos botones.
</p>

<p>
Para crear un control con estas características se usa
</p>

<pre class="example">
		+------------------+					   
		|                  |					   
        +-------|     JSpinner (C) |-------------------+		   
	|	|                  |		       |		   
	|	+------------------+		       |		   
	|			 		       |		   
	|			 		       |		   
	|			 		       |		   
	|			 		       |		   
  +--------------+		       +----------------------------------+
  |Jspinner() (c)|		       | Jspinner(SpinnerModel modelo) (c)|
  +--------------+		       +----------------------------------+

(C) : clase 
(c) : constructor
</pre>

<p>
Cuando se crea con el constructor por defecto <code>JSpinner()</code>, los
valores son numéricos del 0 al infinito.
</p>

<p>
Si se utiliza el segundo constructor <code>JSpinner(SpinnerModel modelo)</code>
se puede modelar de tal forma que en vez de valores numéricos puedan
ser de otros tipos como:
</p>

<ul class="org-ul">
<li>fechas (se usa la clase <code>SpinnerDateModel</code>)
</li>
<li>valores de texto (se usa la clase <code>SpinnerListModel</code>)
</li>
</ul>

<p>
En este paquete se crean cuatro <code>JSpinner</code> utilizando las diferentes
clases:
</p>

<dl class="org-dl">
<dt> JSpinner de lista </dt><dd>cuatro primeros meses del mes utilizando
<code>SpinnerListModel</code>.
</dd>
<dt> JSpinner de fecha </dt><dd>manipula fechas
</dd>
<dt> JSpinner de lista de fuentes del sistema </dt><dd>utiliza la misma clase
<code>SpinnerListModel</code> solo que la lista de cadenas es las fuentes
del sistema.
</dd>
<dt> JSpinner de números </dt><dd>maneja números como lo hace por defecto solo
que se utiliza la clase <code>SpinnerNumberModel</code> para tener un mejor
control. Aqui se le indica que comienze en cinco y vaya de dos en
dos. Como tope inferior se le indica a 0 y como tope superior se
le indica a 10
</dd>
</dl>

<p>
Se colocaro estos controles solo para probar la interfaz que
proporciona <code>JSpinner</code>. No se le añade Eventos. Los eventos con
JSpinner se tratan en el siguiente paquete (<code>video99</code>).
</p>
</div>
</div>


<div id="outline-container-sec-6-7-2" class="outline-4">
<h4 id="sec-6-7-2"><span class="section-number-4">6.7.2</span> [<a href="https://www.youtube.com/watch?v=nOisCjNznaE&index=99&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video99</a>] JSpinner II</h4>
<div class="outline-text-4" id="text-6-7-2">
<p>
Se cambia el modelo del <code>JSpinner</code> para que, cuando se pulse el botón
de arriba, se decremente en vez de incrementar y cuando se pulse el
botón de abajo se incremente.
</p>

<p>
Para hacer esto tenemos que crear nuestro propio modelo, porque en
ninguno de los modelos, que podemos utilizar por defecto en java
(<code>SpinnerListModel</code>, <code>SpinnerDateModel</code>, <code>SpinnerNumberModel</code>), hace
que este comportamiento cambie.
</p>

<p>
En este paquete tambien se trata en concepto nuevo, muy importante y
quizá complejo: <b>las clases internas anónimas</b>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6-8" class="outline-3">
<h3 id="sec-6-8"><span class="section-number-3">6.8</span> [<a href="https://www.youtube.com/watch?v=L_QzjDWoKDo&index=100&list=PLU8oAlHdN5BktAXdEVCLUYzvDyqRQJ2lk">video100</a>] Creación de menús I</h3>
<div class="outline-text-3" id="text-6-8">
<p>
Para construir menús Swing, dentro de una aplicación Java, tenemos que
manejar fundamentalmente las clases:
</p>
<ul class="org-ul">
<li><code>JMenuBar</code>
</li>
<li><code>JMenu</code>
</li>
<li><code>JMenuItem</code>
</li>
</ul>

<p>
El <code>JMenuBar</code> sirve como elemento de soporte en donde se colocarán los
objetos de <code>JMenu</code>. Y dentro de <code>JMenu</code> irán objetos de <code>JMenuItem</code>
para formar una especie de pestañas.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: wegt</p>
<p class="date">Created: 2018-03-05 lun 21:00</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
